#pragma once
#include "stdafx.h"

//dword_7966984
//#define pSetCursorFocus			*(DWORD*)0x7960B54
//#define pSetCursorFocus2		*(BYTE*)0x78C5274

//#define pSetCursorFocus		*(DWORD*)0x7EBD020	//Done
#define pProtocolCores										((int(__cdecl*)(int, PBYTE, int, int))0x0050A070)
#define pCursorX                *(int*)0x7EB37E4 //OK
#define pCursorY                *(int*)0x7EB37E0  //OK
#define pOnLine					*(DWORD*)0x587C394 //ok
#define pGameWindow				*(HWND*)0x5877F90  //ok
#define pUserStat				((LPVOID(*)()) 0x588D70)//???
//#define pSetCursorFocus				*(DWORD*)0x7EB71F0
#define	MAIN_WINDOW				0x05877F90
#define pPreviewThis            ((LPVOID(*)()) 0x0074C447) // ok
#define pGetPreviewStruct        ((DWORD(__thiscall*)(LPVOID This, int ViewportID)) 0x754F4BC)  //ok    // 0x00731FB8
#define pGetPosFromAngle        ((void(__cdecl*)(VAngle * Angle, int * PosX, int * PosY)) 0x006B7DE4)  //OK!!
//
//#define sub_6D7CE3            ((int(__cdecl*)(int)) 0x006D7CE3) // ok
//#define sub_682783      ((void(__cdecl*)(int a1, char a2, int a3, int a4)) 0x682783) //
//#define sub_6771F8            ((char(__cdecl*)(float a1, float a2, float a3)) 0x006771F8) // 
//#define sub_791979            ((int(__cdecl*)()) 0x00791979) //Random?
#define sub_45FC93  ((char(__cdecl*)(int Struct, int a2)) 0x0045FC93) // 
//int sub_791979()
//int __thiscall sub_6D7CE3(int this)
#define pSetBlend                ((void(__cdecl*)(BYTE Mode)) 0x6B8239) //ok
//tplist

//#define pHelmSetAncient(x)				*(BYTE*)(x + 236)
//#define pArmorSlot(x)					*(WORD*)(x + 264)
//#define pArmorSetLevel(x)				*(BYTE*)(x + 266)
//#define pArmorSetExcellent(x)			*(BYTE*)(x + 267)
//#define pArmorSetAncient(x)				*(BYTE*)(x + 268)
//#define pPantsSlot(x)					*(WORD*)(x + 296)
//#define pPantsSetLevel(x)				*(BYTE*)(x + 298)
//#define pPantsSetExcellent(x)			*(BYTE*)(x + 299)
//#define pPantsSetAncient(x)				*(BYTE*)(x + 300)
//#define pGlovesSlot(x)					*(WORD*)(x + 328)
//#define pGlovesSetLevel(x)				*(BYTE*)(x + 330)
//#define pGlovesSetExcellent(x)			*(BYTE*)(x + 331)
//#define pGlovesSetAncient(x)			*(BYTE*)(x + 332)
//#define pBootsSlot(x)					*(WORD*)(x + 360)
//#define pBootsSetLevel(x)				*(BYTE*)(x + 362)
//#define pBootsSetExcellent(x)			*(BYTE*)(x + 363)
//#define pBootsSetAncient(x)				*(BYTE*)(x + 364)
//#define pWeaponFirstSlot(x)				*(WORD*)(x + 392)
//#define pWeaponFirstSetLevel(x)			*(BYTE*)(x + 394)
//#define pWeaponFirstSetExcellent(x)		*(BYTE*)(x + 395)
//#define pWeaponFirstSetAncient(x)		*(BYTE*)(x + 396)
//#define pWeaponSecondSlot(x)			*(WORD*)(x + 424)
//#define pWeaponSecondSetLevel(x)		*(BYTE*)(x + 426)
//#define pWeaponSecondSetExcellent(x)	*(BYTE*)(x + 427)
//#define pWeaponSecondSetAncient(x)		*(BYTE*)(x + 428)
//#define pWingsSlot(x)					*(WORD*)(x + 456)
//#define pSetUnknown1(x)					*(BYTE*)(x + 458)
//#define pSetUnknown2(x)					*(BYTE*)(x + 459)
//#define pSetUnknown3(x)					*(BYTE*)(x + 460)
#define pPetSlot(x)						*(WORD*)(x + 488)//??
//#define pSetUnknown4(x)					*(BYTE*)(x + 490)
//#define pFenrirCharSet(x)				*(BYTE*)(x + 491)
//#define pExpectPet(x)					*(BYTE*)(x + 492)
//#define pObjAction(x)					*(BYTE*)(x + 718)
//#define pObjScale(x)					*(DWORD*)(x + 796)
//#define pObjSelectZone(x)				*(float*)(x + 924)
//#define pGetPosition(x)					*(WORD*)(x + 952)



#define LODWORD(h)				((DWORD)(__int64(h) & __int64(0xffffffff)))
// ----
#define CS_START				1156 //ok
// ----
#define CS_EMPTY_SLOT			-1
#define CS_EMPTY_ITEM			511
#define CS_EMPTY_WEAPON			4095 //4095-old // ITEM(7, 511)
// ----
#define	CS_SET_1(x)				( x >> 2)
// ----8191
#define CS_HELM					8827 // 9297 for 5.4, need check, maybe it value from * on ITEM_INTER//OK!
#define CS_ARMOR				CS_HELM + 20
#define CS_PANTS				CS_ARMOR + 20
#define CS_GLOVES				CS_PANTS + 20
#define CS_BOOTS				CS_GLOVES + 20
// ----
#define CS_GET_STRUCT(x, y)		(CS_START * x + *(int*)y)
#define CS_GET_WEAPON(x, y)		( y | (16 * (x & 0xF0)) )
#define CS_GET_HELM(x, y, z)	( (32 * (z & 0xF)) + 16 * ((x >> 7) & 1) + (y >> 4) )
#define CS_GET_ARMOR(x, y, z)	( (32 * ((z >> 4) & 0xF)) + 16 * ((x >> 6) & 1) + (y & 0xF) )
#define CS_GET_PANTS(x, y, z)	( (32 * (z & 0xF)) + 16 * ((x >> 5) & 1) + (y >> 4) )
#define CS_GET_GLOVES(x, y, z)	( (32 * ((z >> 4) & 0xF)) + 16 * ((x >> 4) & 1) + (y & 0xF) )
#define CS_GET_BOOTS(x, y, z)	( (32 * (z & 0xF)) + 16 * ((x >> 3) & 1) + (y >> 4) )
#pragma pack(push, 1)
struct VAngle
{
    float X;
    float Y;
    float Z;
};

#pragma pack(pop)

#pragma pack(push, 1)
struct ObjectModel_424
{
	float Unknown0;
	float Unknown4;
	float Unknown8;
	float Unknown12;
	float Unknown16;
	float Unknown20;
	float Unknown24;
	float Unknown28;
	float Unknown32;
	float Unknown36;
	float Unknown40;
	float Unknown44;
};
#pragma pack(pop)

#pragma pack(push, 1)
struct Character_Structure
{
	float Unknown0;
	float Unknown4;
	float Unknown8;
	float Unknown12;
	float Unknown16;
	float Unknown20;
	float Unknown24;
	float Unknown28;
	float Unknown32;
	float Unknown36;
	float Unknown40;
	float Unknown44;
};
#pragma pack(pop)

#pragma pack(push, 1)
struct UnknownStruct0
{
	/*+0*/	WORD	Unknown0;//?
	/*+2*/	WORD	Unknown2;//?
	/*+4*/	WORD	Unknown4;//?
	/*+6*/	WORD	Unknown6;
	/*+8*/	WORD	Unknown8;
	/*+10*/	WORD	Unknown10;
	/*+12*/	WORD	Unknown12;//?
	/*+14*/	WORD	Unknown14;
	/*+16*/	WORD	Unknown16;
};
#pragma pack(pop)
#pragma pack(push, 1)
typedef struct	//-> Complete (size: 107)
{
/*+0*/		WORD	m_Type;   //OK
BYTE	Shift1[2];
/*+4*/	   DWORD	m_Level;  //OK
/*+8*/		BYTE	Unknown8; //OK
BYTE	Shift2[1];
/*+10*/		BYTE	Unknown10; //OK
BYTE	Shift3[1];
/*+12*/		WORD	DamageMin; //OK
/*+14*/		WORD	DamageMax; //OK
/*+16*/		BYTE	Unknown16; //OK
BYTE	Shift4[1];
/*+18*/		WORD	Defense;   //OK
/*+20*/		WORD	MagicDefense; //OK
/*+22*/		BYTE	Unknown22;  //OK
/*+23*/		BYTE	Unknown23;  //OK
/*+24*/		WORD	Unknown24; //OK
/*+26*/	    BYTE	Unknown26; //OK
/*+27*/	    BYTE	FenrirCode; //OK ??? or excellent opt??
/*+28*/	    BYTE	Unknown28; //OK
/*+29*/	    BYTE	Unknown29; //OK
/*+30*/		WORD	ReqStrenght; //OK
/*+32*/		WORD	ReqDextirity; //OK
/*+34*/		WORD	ReqEnergy; //OK
/*+36*/		WORD	ReqVitality; //OK
/*+38*/		WORD	ReqCommand; //OK
/*+40*/		WORD	ReqLevel; //OK
/*+42*/		BYTE	SpecialCount; //OK
/*+43*/		BYTE	SpecialType[8];  //OK
/*+51*/		BYTE	SpecialValue[8]; //OK


///*+59*/		BYTE	Unknown59; //OK
///*+60*/	   DWORD	Unknown60; //OK
///*+62*/		BYTE	Unknown62; //OK
///*+63*/		BYTE	Unknown63; //OK
///*+64*/		BYTE	Unknown64; //OK
///*+65*/		BYTE	Unknown65; //OK
///*+66*/		BYTE	Unknown66;
///*+67*/		BYTE	Unknown67;
///*+68*/		BYTE	Unknown68;
///*+69*/		BYTE	Unknown69;
///*+70*/		WORD	Unknown70;
///*+72*/		WORD	Unknown72;
///*+74*/		BYTE	Unknown74;


///SIZE 124
} ObjectItem, * lpItemObj;
#pragma pack(pop)

//---------------------------------------------------------------------------

//#pragma pack(push, 1)
////struct ObjectCharacter	
//typedef struct//struct ObjectCharacter	//-> ~InDev (size: 6012) [77AEE08 | ??]
//{
///*+0*/		char	Name[11];
///*+11*/		char	Class;
///*+12*/		BYTE	Unknown12;
///*+13*/		BYTE	Unknown13;
///*+14*/		short	Level;
//WORD Resets;
///*+16*/		DWORD	Experience;
///*+20*/		DWORD	NextExperience;
///*+24*/		short	Strength;
///*+26*/		short	Dexterity;
///*+28*/		short	Vitality;
///*+30*/		short	Energy;
///*+32*/		short	Leadership;
///*+34*/		WORD	Life;	//22
///*+36*/		WORD	Mana;	//24
///*+38*/		WORD	MaxLife;	//26
///*+40*/		WORD	MaxMana;	//28
///*+42*/		WORD	Shield;		//2A
///*+44*/		WORD	MaxShield;	//2C
///*+46*/		WORD	AttackRate;	//2E
///*+48*/		WORD	DefenseRate;
///*+50*/		short	AddStrength;
///*+52*/		short	AddDexterity;
///*+54*/		short	AddVitality;
///*+56*/		short	AddEnergy;
//BYTE gap01[4];
///*+62*/		WORD	AddLeadership;	//GS use unsigned value...
///*+64*/		WORD	Stamina;
///*+66*/		WORD	MaxStamina;
///*+68*/		BYTE	ItemSpecialUseFlag;		//Bit decomposit (1, 2, 8)
//BYTE UnknownGap;
///*+70*/		WORD	ItemSpecialUseTime[3];	//[ ]
///*+76*/		WORD	AddPoint;	//FruitStat start
///*+78*/		WORD	MaxAddPoint;
///*+80*/		WORD	MinusPoint;
///*+82*/		WORD	MaxMinusPoint;	//FruitStat end
///*+84*/		WORD	AttackSpeed;
///*+86*/		WORD	DamageRate;
///*+88*/		WORD	DamageMin;
///*+90*/		WORD	DamageMax;
///*+92*/		WORD	Unknown92;
///*+94*/		WORD	Unknown94;
///*+96*/		WORD	MagicSpeed;	//Test
//BYTE gap02[10];
///*+108*/	WORD	Unknown108;
///*+110*/	WORD	Unknown110;
//BYTE gap03[4];
///*+116*/	WORD	LevelPoint;
///*+118*/	BYTE	MagicCount;
///*+119*/	BYTE	Unknown119;
///*+120*/	WORD	pMagicList[650];	//maybe 150?	//Original 650
///*1420*/
//BYTE gap04[3252];
///*+4672*/	ObjectItem pEquipment[12];
///*+5956*/	DWORD	MoneyInventory;	//(C4)
///*+5960*/	DWORD	MoneyWarehouse;	//(C4)
//BYTE gap05[8];
///*+5972*/	UnknownStruct0 Unknown5972;
//BYTE gap06[2];
///*+5992*/	WORD	Unknown5992;
///*+5994*/	WORD	Unknown5994;
//BYTE gap07[2];
///*+5998*/	WORD	Unknown5998;
///*+6000*/	WORD	Unknown6000;
///*+6002*/	WORD	Unknown6002;
///*+6004*/	WORD	Unknown6004;
///*+6006*/	WORD	Unknown6006;
///*+6008*/	BYTE	Unknown6008;
///*+6009*/	BYTE	Unknown6009;
///*+6010*/	BYTE	Unknown6010;
///*+6011*/	BYTE	Unknown6011;
//}ObjectCharacter, * lpCharObj;//;
//#pragma pack(pop)


/////////////////////////////////////////////////////////////////////////////
//#pragma pack(push, 1)
typedef struct	//-> ~InDev (size: 6012) [77AEE08 | ??]
{
/*+0*/		char	Name[11];
/*+11*/		BYTE	Class; //OK
/*+12*/		BYTE	Unknown12; 
/*+13*/		BYTE	Unknown13;
/*+14*/		short	Level;  //OK
/*+16*/		DWORD	Experience; //OK
/*+20*/		DWORD	NextExperience; //OK
/*+24*/		short	Strength;
/*+26*/		short	Dexterity;
/*+28*/		short	Vitality;
/*+30*/		short	Energy;
/*+32*/		short	Leadership;
/*+34*/		WORD	Life;
/*+36*/		WORD	Mana;
/*+38*/		WORD	MaxLife;
/*+40*/		WORD	MaxMana;
/*+42*/		WORD	Shield;
/*+44*/		WORD	MaxShield;
/*+46*/		WORD	AttackRate;
/*+48*/		WORD	DefenseRate;
/*+50*/		short	AddStrength;
/*+52*/		short	AddDexterity;
/*+54*/		short	AddVitality;
/*+56*/		short	AddEnergy;
			short	Resets;
BYTE gap01[4];
/*+62*/		WORD	AddLeadership;	//GS use unsigned value...
/*+64*/		WORD	Stamina;
/*+66*/		WORD	MaxStamina;
/*+68*/		BYTE	ItemSpecialUseFlag;		//Bit decomposit (1, 2, 8)
BYTE UnknownGap;
/*+70*/		WORD	ItemSpecialUseTime[3];	//[ ]
///*+74*/		WORD	Unknown74;	//[ ]???
/*+76*/		WORD	AddPoint;	//FruitStat start
/*+78*/		WORD	MaxAddPoint;
/*+80*/		WORD	MinusPoint;
/*+82*/		WORD	MaxMinusPoint;	//FruitStat end
/*+84*/		WORD	AttackSpeed;
/*+86*/		WORD	DamageRate;
/*+88*/		WORD	DamageMin;
/*+90*/		WORD	DamageMax;
/*+92*/		WORD	Unknown92;
/*+94*/		WORD	Unknown94;
/*+96*/		WORD	Unknown96;
BYTE gap02[10];
///*+104*/	WORD	Unknown104;
///*+106*/	WORD	Unknown106;
/*+108*/	WORD	Unknown108;
/*+110*/	WORD	Unknown110;
/*+112*/	WORD	Unknown112;
/*+114*/	BYTE	Unknown114;
/*+115*/	BYTE	Unknown115;
/*+116*/	WORD	LevelPoint;  //BYTE?
/*+118*/	BYTE	MagicCount;
/*+119*/	BYTE	Unknown119;
/*+120*/	WORD	pMagicList[650];	//maybe 150?
/*1420*/
///*+628*/	BYTE	Unknown628;
BYTE gap04[3252];
/*+4672*/	ObjectItem pEquipment[12];
/*+5956*/	DWORD	MoneyInventory;	//(C4)
/*+5960*/	DWORD	MoneyWarehouse;	//(C4)
BYTE gap05[8];
/*+5972*/	UnknownStruct0 Unknown5972;
BYTE gap06[2];
/*+5992*/	WORD	Unknown5992;
/*+5994*/	WORD	Unknown5994;
BYTE gap07[2];
/*+5998*/	WORD	Unknown5998;
/*+6000*/	WORD	Unknown6000;
/*+6002*/	WORD	Unknown6002;
/*+6004*/	WORD	Unknown6004;
/*+6006*/	WORD	Unknown6006;
/*+6008*/	BYTE	Unknown6008;
/*+6009*/	BYTE	Unknown6009;
/*+6010*/	BYTE	Unknown6010;
/*+6011*/	BYTE	Unknown6011;
}ObjectCharacter, * lpCharObj;
//#pragma pack(pop)
/////////////////////////////////////////////////////////////////////////////
#pragma pack(push, 1)
struct ObjectModel	//648? 848!!
{
BYTE gap00[4];
/*+4*/	BYTE	Unknown4;
BYTE gap01[4];
/*+9*/	BYTE	Unknown9;
BYTE gap02[2];
/*+12*/	BYTE	Unknown12;
BYTE gap022[2];
/*+15*/	BYTE	Unknown15;
BYTE gap03[2];
/*+18*/	WORD	AnimationID;
/*+20*/	WORD	Unknown20;
/*+22*/	BYTE	Unknown22;
/*+23*/	BYTE	Unknown23;
/*+24*/	BYTE	ObjectType;
BYTE gap04[13];
/*+38*/	WORD	Unknown38;
BYTE gap05[8];
/*+48*/	DWORD	Unknown48;
BYTE gap06[44];
/*+96*/	float	Scale;
BYTE gap07[16];
/*+116*/	float	Unknown116;
BYTE gap08[20];
/*+140*/	float	Unknown140;
/*+144*/	float	Unknown144;
BYTE gap09[56];
/*+204*/	VAngle	Unknown204;
/*+216*/	VAngle	Unknown216;
BYTE gap10[24];
/*+252*/	float	VecPosX;
/*+256*/	float	VecPosY;
/*+260*/	float	VecPosZ;
/*+252*/	VAngle	VecPos;
/*+264*/	VAngle	Angle;
/*+264*/	float	Unknown264;
/*+268*/	float	Unknown268;
/*+272*/	float	Unknown272;
BYTE gap11[148];
/*+424*/	ObjectModel_424 Unknown424;
BYTE gap12[176];
/*+484*/
};
#pragma pack(pop)
// ----------------------------------------------------------------------------------------------
//SIZE 1156
//#pragma pack(push, 1)
typedef struct
{
/*0*/   WORD    Live; //??
/*2*/	WORD	MauntType;      //??           
/*4*/	DWORD	Unknown4;      //??     
/*8*/	BYTE	Unknown8;
BYTE	Shift2[2];
/*12*/	DWORD	ModelScale;              
/*16*/	float	VecPosX;           
/*20*/	float	VecPosY;              
/*24*/	float	VecPosZ;    
///*28*/	DWORD	Unknow28;
///*32*/	DWORD	Unknow32;
/*+32*/        BYTE    PKLevel;
///*36*/	DWORD	Unknow36;
///*38*/	WORD	Unknow38;   //!!!!!!!!!!
BYTE	Shift33[53];  
/*82*/	WORD	UnknowTest;             
BYTE	Shift3[103];  
///*+126*/    WORD    aIndex;
///*148*/	DWORD	Unknow148;
///*152*/	DWORD	Unknow152;
///*168*/	DWORD	Unknow168;  
///*176*/	DWORD	Unknow176;  //!!!!!!!!!
/*188*/ BYTE  TypeName;  
/*189*/ BYTE  Type; //?? 
/*190*/ WORD  Unknow190;   //??
///*204*/	BYTE	Unknow204;
///*296*/	DWORD	Unknow296;  !!
///*300*/	DWORD	Unknow300;  !!
///*304*/	DWORD	Unknow304;   !!
BYTE	Shift113[124];  
/*316*/	DWORD	Unknow316; //??
BYTE	Shift1113[5];
/*325*/	BYTE	Action; 
BYTE	Shift114[2];  
/*328*/	DWORD	Unknow328; //??
///*332*/	DWORD	Unknow332;
BYTE	Shift4[32];
/*364*/	float	SelectZone;   
BYTE	Shift44[48];
///*416*/ BYTE    Unknown416; //!!!!!!!!
///*448*/ BYTE    Unknown448; //!!!!!!!!
///*452*/ DWORD   Unknown452; //!!!!!!!!
/*416*/	BYTE	Unknown416;
BYTE	Shift412[48];
/*464*/	BYTE	Unknown464;   
BYTE	Shift5[38];     
///*500*/	DWORD	Unknown500;  
/*504*/	WORD    Unknown504;  
BYTE	Shift51[18]; 
/*524*/	BYTE	Class;   
///*525*/	BYTE	Unknow525;      !!!!
///*526*/	WORD	Unknown526;   //!!!!!!!!
BYTE	Shift512[4]; 
///*528*/	BYTE	Unknow28;
/*529*/	char	Name[25];  
BYTE	Shift612[8];
/*562*/	WORD	Unknow562;// ???
/*564*/	WORD	VPIndex;
BYTE	Shift6[34];
/*600*/	WORD	HelmSlot;				 
/*602*/	BYTE	HelmLevel;				
/*603*/	BYTE	HelmExcellent;		   
/*604*/	BYTE	HelmAncient;	
///*605*/ BYTE   Unknown605;         //!!!!!!!!!??
BYTE	Shift7[27];
/*632*/	WORD	ArmorSlot;		   
/*634*/	BYTE	ArmorLevel;		    
/*635*/	BYTE	ArmorExcellent;		   
/*636*/	BYTE	ArmorAncient;   		
///*637*/ BYTE   Unknown637;         //!!!!!!!!!??
BYTE	Shift8[27];
/*664*/	WORD	PantsSlot;   		   
/*666*/	BYTE	PantsLevel;   		  
/*667*/	BYTE	PantsExcellent;   	
/*668*/	BYTE	PantsAncient;  
///*669*/ BYTE   Unknown669;         //!!!!!!!!!??
BYTE	Shift9[27];
/*696*/	WORD	GlovesSlot;   		   
/*698*/	BYTE	GlovesLevel;   		  
/*699*/	BYTE	GlovesExcellent;   		
/*700*/	BYTE	GlovesAncient;   
///*701*/ BYTE   Unknown701;         //!!!!!!!!!??
BYTE	Shift10[27];
/*728*/	WORD	BootsSlot;   		    
/*730*/	BYTE	BootsLevel;   		     
/*731*/	BYTE	BootsExcellent;   		
/*732*/	BYTE	BootsAncient;  
///*733*/ BYTE   Unknown733;         //!!!!!!!!!??
BYTE	Shift11[27];
/*760*/	WORD	WeaponFirstSlot;		
/*762*/	BYTE	WeaponFirstLevel;		
/*763*/	BYTE	WeaponFirstExcellent;	
/*764*/	BYTE	WeaponFirstAncient;  
///*765*/ BYTE   Unknown765;         //!!!!!!!!!??
BYTE	Shift12[27];
/*792*/	WORD	WeaponSecondSlot;		
/*794*/	BYTE	WeaponSecondLevel;	
/*795*/	BYTE	WeaponSecondExcellent;   
/*796*/	BYTE	WeaponSecondAncient;     
///*797*/ BYTE   Unknown797;         //!!!!!!!!!
BYTE	Shift13[27];
/*824*/	WORD	WingsSlot;              
/*826*/ BYTE	WingsLevel;              
/*827*/	BYTE	WingsExcellent;           
/*828*/	BYTE	WingsAncient; 
///*829*/ BYTE   Unknown829;         //!!!!!!!!!
///*832*/ DWORD   Unknown832;         //!!!!!!!!!
BYTE	Shift14[27];
/*856*/	WORD	PetSlot;                
/*858*/ BYTE	Unknown858;            
/*859*/ BYTE	FenrirCharSet;          
/*860*/ BYTE	ExpectPet;      
///*861*/ BYTE   Unknown861;         //!!!!!!!!!
BYTE	Shift15[59];
/*920*/	BYTE	AncientEffect; 
///*924*/ DWORD   Unknown924;         //!!!!!!!!!
BYTE	Shift16[7];
/*928*/	BYTE	StatusEffect;   
BYTE	Shift117[21];
///*948*/ BYTE   Unknown948;         //!!!!!!!!!
///*949*/ BYTE   Unknown949;         //!!!!!!!!!
/*950*/	WORD	m_Change; 
BYTE	Shift145[28];
///*969*/ BYTE   Unknown969;         //!!!!!!!!!
/*980*/	DWORD	Unknown980;  
BYTE	Shift197[12];
/*996*/ WORD	Unknown996;  
BYTE	Shift17[61];
///*1014*/ DWORD   Unknown1014;     //!!!!!!!!!!!!!
///*1016*/ DWORD   Unknown1016;     //!!!!!!!!!!!!!
///*1020*/ DWORD   Unknown1020;     //!!!!!!!!!!!!!
///*1058*/ BYTE   Unknown1058;     //!!!!!!!!!!!!!
/*1059*/ BYTE   Visible;  
///*1060*/	BYTE	Unknown1060;   //!!!!!!!!!!!!!
///*1116*/ DWORD	Unknow1116; 
///*1120*/ DWORD	Unknow1120;  
///*1144*/ DWORD   Unknown1144;    //!!!!!!!!!!!
/*+776*/    ObjectModel    m_Model;
/*+1424*/    BYTE    Unknown1424;    //maybe gens rank
BYTE gap23[3];
/*+1428*/    DWORD    Unknown1428;    //-> end
}ObjectPreview, * lpViewObj;
//#pragma pack(pop)
//#pragma pack(push, 1)
//struct struct_a1
//{
//  _BYTE f0[2];
//  _WORD word2;
//  _DWORD dword4;
//  _BYTE f8[440];
//  _BYTE byte1C0;
//  _BYTE f1C1[3];
//  _DWORD dword1C4;
//  _BYTE f1C8[68];
//  _BYTE byte20C;
//  _BYTE f20D[1];
//  _WORD word20E;
//  _BYTE f210[34];
//  _WORD word232;
//  _WORD word234;
//  _BYTE f236[66];
//  _WORD word278;
//  _BYTE f27A[94];
//  _WORD word2D8;
//  _BYTE f2DA[30];
//  _WORD word2F8;
//  _BYTE f2FA[3];
//  _BYTE byte2FD;
//  _BYTE f2FE[26];
//  _WORD word318;
//  _BYTE f31A[3];
//  _BYTE byte31D;
//  _BYTE f31E[26];
//  _WORD word338;
//  _BYTE f33A[3];
//  _BYTE byte33D;
//  _BYTE f33E[2];
//  _DWORD dword340;
//  _BYTE f344[20];
//  _WORD word358;
//  _BYTE byte35A;
//  _BYTE f35B[2];
//  _BYTE byte35D;
//  _BYTE f35E[58];
//  _BYTE byte398;
//  _BYTE f399[3];
//  _DWORD dword39C;
//  _BYTE byte3A0;
